CREATE TABLE shops (
	id serial PRIMARY KEY,
	name varchar(50) NOT NULL
);

CREATE TABLE products (
	id serial PRIMARY KEY,
	shop_id int references shops(id) on delete cascade on update cascade,
	title varchar(1000) NOT NULL,
	description varchar(5000) NULL,
	img_url varchar(500) NOT NULL,
	price int
);

CREATE TABLE orders (
	id serial PRIMARY KEY,
	name varchar(50) NOT NULL,
	phone varchar(10) NOT NULL,
	email varchar(100) NOT NULL,
	adress varchar(1000) NOT NULL
);

CREATE TABLE order_products (
	order_id int references shops(id) on delete cascade on update cascade,
	product_id int references products(id) on delete cascade on update cascade,
	quantity int not null
);


insert into shops (name) values ('Доброго Дня');
insert into shops (name) values ('Здорова Родина');
insert into shops (name) values ('Бажаємо здоровя');
insert into shops (name) values ('Мед-Сервіс');
insert into shops (name) values ('Соціальна Аптека');
insert into shops (name) values ('Аптека оптових цін');
insert into shops (name) values ('Сімейна аптека');
insert into shops (name) values ('ІВА-ФАРМ');
 

insert into products (shop_id, title, description, img_url, price) 
values 
(
	1, 
	'Аскорбінка-КВ таблетки зі смак. полун. по 25 мг №10 в етикет', 
	'Прості препарати аскорбінової кислоти (вітаміну С). Аскорбінова кислота (вітамін С). Код АТХ A11G А01', 
	'/images/img_0(1).jpg', 
	14 
),
(
     1, 
	 'Парацетамол  капсули 500 мг №10',
	 'Тверді желатинові капсули від блакитного до світло-синього кольору. 
     Вміст капсул – суміш, що містить гранули та порошок від білого до майже білого кольору.
     Препарат містить  – аналгетик та антипіретик (знеболювальний і жарознижувальний засіб)',
	 '/images/img_0(5).jpg',
     20
),
(
     1,
	 'Йодомарин 200',
	 'Йодомарин 200 таблетки по 200 мкг №50 (25х2)',
	 '/images/img_0(2).jpg', 
     135 
),
(
     1,
	 'Проктозан нео',
	 'Проктозан нео супозиторії рект. №10 (5х2). Проктозан® НЕО забезпечує ефективне лікування характерних симптомів та наслідків геморою. 
	  Препарат швидко усуває запалення в аноректальній ділянці, а також супутні відчуття, такі як свербіж, печіння,
      поколювання, біль та відчуття вологості',
	 '/images/img_0(3).jpg', 
     400 
),
(
     1,
	 'Спазмалгон таблетки №20 (10х2)',
	 'Проктозан нео супозиторії рект. №10 (5х2). Проктозан® НЕО забезпечує ефективне лікування характерних симптомів та наслідків геморою, 
	 Спазмалгон® виявляє аналгетичну, спазмолітичну (папавериноподібну), холінолітичну (атропіноподібну) і деяку протизапальну активність',
	 '/images/img_0(4).jpg', 
     130 
);
  
 insert into products (shop_id, title, description, img_url, price) 
 values 
 (
     2,
     'Аскорбінка-КВ таблетки зі смак. полун. по 25 мг №10 в етикет',
     'Аскорбінова кислота (вітамін C) має виражені відновлювальні властивості. Належить до групи водорозчинних вітамінів',
     '/images/img_1(1).jpg', 
	 11
),
   (
     2,
     'Парацетамол капсули по 500 мг №10',
     'Тверді желатинові капсули від блакитного до світло-синього кольору. 
     Вміст капсул – суміш, що містить гранули та порошок від білого до майже білого кольору.
     Препарат містить  – аналгетик та антипіретик (знеболювальний і жарознижувальний засіб)',
    '/images/img_1(2).jpg', 
     17
),
(
    2,
     'Цитрамон-Дарниця таблетки №10',
     'Лікарський засіб чинить аналгезивну, жарознижувальну та протизапальну дію. 
	 Компоненти, що входять до складу лікарського засобу, посилюють ефекти один одного.',
     '/images/img_1(3).jpg', 
     30
),
(
     2,
     'Магній Судоми Медівіт таблетки №56 (28х2)',
     'Магній Судоми Медівіт - комплекс з магнієм з цілеспрямованою дією, 
	 що сприяє ефективному і швидкому вирішенню проблематики судом, а також належному функціонуванню серцево-судинної системи',
     '/images/img_1(4).jpg', 
     170
),
(
	 2,
     'Бронхофіт збір по 1.5 г №20 у філ.-пак',
     'Препарат БРОНХОФІТ має секретолітичну і секретокінетичну дії. Стимулює серозні клітини залоз слизової оболонки бронхів,
	  збільшуючи вміст слизового секрету, внаслідок чого змінюється співвідношення слизового та серозного компонентів мокротиння',
     '/images/img_1(5).jpg', 
     90
);




insert into products (shop_id, title, description, img_url, price) 
values 
(
     3,
     'Но-шпа таблетки по 40 мг, 24 шт',
     'Опуклі таблетки жовтого кольору із зеленуватим або помаранчевим відтінком; з гравіюванням «spa» з одного боку.
     Засоби, які застосовуються при функціональних шлунково-кишкових розладах',
     '/images/img_2(1).jpg', 
     85

),
(
      3,
     'Терафлю Екстра зі смаком лимона',
     'Порошокошок для орального розчину у пакетах № 1, № 10.
      1 пакет містить парацетамолу 650 мг, феніраміну малеату 20 мг, фенілефрину гідрохлориду 10 мг (PARACETAMOLUM)',
     '/images/img_2(2).jpg', 
     390
),
(
     3,
     'Аскорбінка-КВ таблетки зі смак. тутті-фрутті по 25 мг №10 в етикет',
     'Аскорбінова кислота (вітамін C) має виражені відновлювальні властивості. Належить до групи водорозчинних вітамінів',
     '/images/img_2(3).jpg', 
     12
),
(
     3,
     'Парацетамол капсули по 500 мг №10',
     'Тверді желатинові капсули від блакитного до світло-синього кольору. Вміст капсул – суміш, що містить гранули та
      порошок від білого до майже білого кольору. Препарат містить  – аналгетик та антипіретик (знеболювальний і жарознижувальний засіб)',
     '/images/img_2(4).jpg', 
     20
 ),
 (
     3,
     'Отривін спрей назал. доз. 0,1 % фл',
     'Протинабрякові та інші препарати для місцевого застосування у разі захворювань порожнини носа',
     '/images/img_2(5).jpg', 
     100
 );

 insert into products (shop_id, title, description, img_url, price) values 
(
     4,
     'Бронхофіт збір по 1.5 г №20 у філ.-пак',
     'Препарат БРОНХОФІТ має секретолітичну і секретокінетичну дії. Стимулює серозні клітини залоз слизової оболонки бронхів,
	  збільшуючи вміст слизового секрету, внаслідок чого змінюється співвідношення слизового та серозного компонентів мокротиння',
     '/images/img_1(5).jpg', 
     95
),
(
     4,
	 'Спазмалгон таблетки №20 (10х2)',
	 'Проктозан нео супозиторії рект. №10 (5х2). Проктозан® НЕО забезпечує ефективне лікування характерних симптомів та наслідків геморою. 
	 Спазмалгон® виявляє аналгетичну, спазмолітичну (папавериноподібну), холінолітичну (атропіноподібну) і деяку протизапальну активність',
	 '/images/img_0(4).jpg', 
     135
),
(
     4,
     'Аскорбінка-КВ таблетки зі смак. тутті-фрутті по 25 мг №10 в етикет',
     'Аскорбінова кислота (вітамін C) має виражені відновлювальні властивості. Належить до групи водорозчинних вітамінів',
     '/images/img_2(3).jpg', 
     11
),
(
    4,
	 'Йодомарин 200',
	 'Йодомарин 200 таблетки по 200 мкг №50 (25х2)',
	 '/images/img_0(2).jpg', 
     140
),
(
    4,
     'Но-шпа таблетки по 40 мг, 24 шт',
     'Опуклі таблетки жовтого кольору із зеленуватим або помаранчевим відтінком; з гравіюванням «spa» з одного боку.
     Засоби, які застосовуються при функціональних шлунково-кишкових розладах',
     '/images/img_2(1).jpg', 
     90
);

 insert into products (shop_id, title, description, img_url, price) values
(
     5, 
	 'Аскорбінка-КВ таблетки зі смак. полун. по 25 мг №10 в етикет', 
	 'Прості препарати аскорбінової кислоти (вітаміну С). Аскорбінова кислота (вітамін С). Код АТХ A11G А01', 
	 '/images/img_0(1).jpg', 
	 13
),
(
    5, 
     'Парацетамол капсули по 500 мг №10',
     'Тверді желатинові капсули від блакитного до світло-синього кольору. 
     Вміст капсул – суміш, що містить гранули та порошок від білого до майже білого кольору.
     Препарат містить  – аналгетик та антипіретик (знеболювальний і жарознижувальний засіб)',
    '/images/img_1(2).jpg', 
     18
),
(
    5, 
     'Цитрамон-Дарниця таблетки №10',
     'Лікарський засіб чинить аналгезивну, жарознижувальну та протизапальну дію. 
	 Компоненти, що входять до складу лікарського засобу, посилюють ефекти один одного.',
     '/images/img_1(3).jpg', 
     32
),
(
     5, 
     'Магній Судоми Медівіт таблетки №56 (28х2)',
     'Магній Судоми Медівіт - комплекс з магнієм з цілеспрямованою дією, 
	 що сприяє ефективному і швидкому вирішенню проблематики судом, а також належному функціонуванню серцево-судинної системи',
     '/images/img_1(4).jpg', 
     175
),
(
     5, 
     'Отривін спрей назал. доз. 0,1 % фл',
     'Протинабрякові та інші препарати для місцевого застосування у разі захворювань порожнини носа',
     '/images/img_2(5).jpg', 
     100
);

 insert into products (shop_id, title, description, img_url, price) values
(
     6,
     'Мілі Носік краплі, 15 мл',
     'Діючі речовини: хлорфеніраміну малеат, фенілефрину гідрохлорид,
      1 мл містить 2 мг хлорфеніраміну малеату, 2,5 мг фенілефрину гідрохлориду',
     '/images/img_3(1).jpg', 
     252
),
(
     6,
     'Візин класичний крап. оч. 0,05 % фл. 15 мл',
     'Краплі очні, розчин 0,05 % по 15 мл у флаконі з поліетилену з крапельницею; по 1 флакону в картонній упаковці',
     '/images/img_3(2).jpg', 
     185
),
(
      6,
     'Лігор Льодяники для горла зі смаком лайма та мяти №1',
     'Екстракт шавлії (extractum Salviaе officinalis) – 10,0 мг (mg), екстракт евкаліпту (extractum Eucalypti globuli) – 10,0 мг (mg),
	  екстракт ромашки (extractum Matricariaе chamomilla) – 10,0 мг (mg), вітамін С (аскорбінова кислота Е-330) -12,0 мг (mg),
	  допоміжні речовини: цукор, патоковий сироп, вода, лимонна кислота Е - 330, ароматизатор лайм, барвник Е -142 (зелений)',
     '/images/img_3(3).jpg', 
     92
),
(
      6,
     'Бронхолітин Фіто, пастилки, №24',
     'Пастилки травяні (Broncholytin® Phyto, herbal lozenges) — це дієтична добавка до раціону. 
	 Вона є джерелом біологічно активних речовин при сезонних застудних захворюваннях верхніх дихальних шляхів',
     '/images/img_3(4).jpg', 
     193
),
(
      6,
     'Борсуковий жир Екобарс капсули 300 мг №60',
     '100% натуральний топлений борсуковий жир, екологічно чистий.
      Оболонка капсули - яловичий желатин, гліцерин', 
     '/images/img_3(5).jpg',
	 189
);


  insert into products (shop_id, title, description, img_url, price) values
 (
     7, 
	 'Аскорбінка-КВ таблетки зі смак. полун. по 25 мг №10 в етикет', 
	 'Прості препарати аскорбінової кислоти (вітаміну С). Аскорбінова кислота (вітамін С). Код АТХ A11G А01', 
	 '/images/img_0(1).jpg', 
	 15
),
(
     7, 
     'Магній Судоми Медівіт таблетки №56 (28х2)',
     'Магній Судоми Медівіт - комплекс з магнієм з цілеспрямованою дією, 
	 що сприяє ефективному і швидкому вирішенню проблематики судом, а також належному функціонуванню серцево-судинної системи',
     '/images/img_1(4).jpg', 
     175
),
(
     7, 
     'Отривін спрей назал. доз. 0,1 % фл',
     'Протинабрякові та інші препарати для місцевого застосування у разі захворювань порожнини носа',
     '/images/img_2(5).jpg', 
     110

),
(
     7, 
     'Терафлю Екстра зі смаком лимона',
     'Порошокошок для орального розчину у пакетах № 1, № 10.
      1 пакет містить парацетамолу 650 мг, феніраміну малеату 20 мг, фенілефрину гідрохлориду 10 мг (PARACETAMOLUM)',
     '/images/img_2(2).jpg', 
     385

),
(
     7, 
     'Візин класичний крап. оч. 0,05 % фл. 15 мл',
     'Краплі очні, розчин 0,05 % по 15 мл у флаконі з поліетилену з крапельницею; по 1 флакону в картонній упаковці',
     '/images/img_3(2).jpg', 
     180
);

    insert into products (shop_id, title, description, img_url, price) values 
(
     8,
	 'Спазмалгон таблетки №20 (10х2)',
	 'Проктозан нео супозиторії рект. №10 (5х2). Проктозан® НЕО забезпечує ефективне лікування характерних симптомів та наслідків геморою. 
	 Спазмалгон® виявляє аналгетичну, спазмолітичну (папавериноподібну), холінолітичну (атропіноподібну) і деяку протизапальну активність',
	 '/images/img_0(4).jpg', 
     125
),
(
     8,
     'Мілі Носік краплі, 15 мл',
     'Діючі речовини: хлорфеніраміну малеат, фенілефрину гідрохлорид,
      1 мл містить 2 мг хлорфеніраміну малеату, 2,5 мг фенілефрину гідрохлориду',
     '/images/img_3(1).jpg', 
     254
),
   (
     8,
     'Цитрамон-Дарниця таблетки №10',
     'Лікарський засіб чинить аналгезивну, жарознижувальну та протизапальну дію. 
	 Компоненти, що входять до складу лікарського засобу, посилюють ефекти один одного.',
     '/images/img_1(3).jpg', 
     32
),
(
     8,
     'Терафлю Екстра зі смаком лимона',
     'Порошокошок для орального розчину у пакетах № 1, № 10.
      1 пакет містить парацетамолу 650 мг, феніраміну малеату 20 мг, фенілефрину гідрохлориду 10 мг (PARACETAMOLUM)',
     '/images/img_2(2).jpg', 
     394

),
(
     8,
	 'Йодомарин 200',
	 'Йодомарин 200 таблетки по 200 мкг №50 (25х2)',
	 '/images/img_0(2).jpg', 
     138
);




select 
	s."name", sum(op.quantity)
from orders o 
inner join order_products op on op.order_id = o.id 
inner join products p ON p.id = op.product_id 
inner join shops s on s.id = p.shop_id 
group by s."name" 


select 
	o.id, o."name" , o.phone, o.email, o.adress , count(op.order_id), sum(op.quantity)
from orders o 
inner join order_products op on op.order_id = o.id 
group by o.id, o."name" , o.phone, o.email, o.adress 


select * from order_products op where order_id = 4



UPDATE orders AS o
    SET price = (
    SELECT SUM(p.price * op.quantity) 
    FROM order_products AS op
    INNER JOIN products AS p ON op.product_id = p.id
    WHERE op.order_id = o.id
    )
  



   UPDATE order_products AS op
    SET price = (
    SELECT SUM(p.price * op.quantity)
    FROM products AS p
    WHERE p.id = op.product_id
)

select o.id, o."name", o.adress, count(op.order_id) as products_count, sum(op.quantity) as total_products_count, sum(p.price * op.quantity) as total_price
  from orders o 
  inner join order_products op on op.order_id = o.id 
  inner join  products p ON op.product_id = p.id
  where o.phone = $1 and o.email = $2
  group by o.id, o."name" , o.phone, o.email, o.adress



  ----------- coupons 
create table coupons (
	id serial PRIMARY KEY,
	title varchar(100) not null,
	desciption varchar(500) null,
	img_url varchar(100) not null,
	coupon_code varchar(30) not null,
	discount float not null
)

insert into coupons (title, desciption, img_url, coupon_code, discount )
values ('Купуй українське', null, '/images/coupons/buy_ukr.webp', 's!ds494adsl!ds', 5.5);

insert into coupons (title, desciption, img_url, coupon_code, discount)
values ('Кешбек за кожен чек', null, '/images/coupons/cashback.webp', 'asdas3asd@asdasd', 20);


-------------талички для order_products, orders


CREATE TABLE order_products (
	order_id int references orders(id) on delete cascade on update cascade,
	product_id int references products(id) on delete cascade on update cascade,
	quantity int not null,
     price  float
);
 

CREATE TABLE orders (
    id serial PRIMARY KEY,
    name varchar(50) NOT NULL,
    phone varchar(10) NOT NULL,
    email varchar(100) NOT NULL,
    address varchar(1000) NOT NULL,
    coupon_id int references coupons(id) on delete set null on update cascade,
    price  float
);
 


--  добавлення координати в shops
  ALTER TABLE shops ADD COLUMN latitude FLOAT;
  
  ALTER TABLE shops ADD COLUMN longitude float;

select * from shops s


UPDATE shops
SET latitude = 48.313748,
    longitude = 25.89245
WHERE id = 1;

UPDATE shops
SET latitude =48.253147,
    longitude =25.900861
WHERE id = 2;

UPDATE shops
SET latitude =48.312804,
    longitude =25.953059
WHERE id = 3;

UPDATE shops
SET latitude =48.299698,
    longitude =25.991164
WHERE id = 4;


UPDATE shops
SET latitude =48.269861,
    longitude =26.007057
WHERE id = 5;

UPDATE shops
SET latitude =48.249601,
    longitude =25.980317
WHERE id = 6;

UPDATE shops
SET latitude =48.236887, 
    longitude =25.943734
WHERE id = 7;

UPDATE shops
SET latitude =48.271416,
    longitude =25.868358